Pics/YCSB/kv_hash.log
./kv/release/tests/db/kv_bench --cache_size=8388608 --logpath=/mnt/ssd --db=/mnt/nvm/kv_ycsb --threads=4 --open_files=40000 --num=1500000000 --range=1500000000 --reads=2000000 --partition=100 --write_buffer_size=2097152 --batch_size=1000 --stats_interval=1000000 --bloom_bits=10 --low_pool=3 --high_pool=3 --value_size=100 --direct_io=false --histogram=true --log=true --skiplistrep=false --benchmarks=loadreverse,ycsbc,ycsbb,ycsbd,ycsba,ycsbf,ycsbe,stats --ycsb_ops_num=8000000 --seek_nexts=100 --use_existing_db=true --print_wa=true --log_dio=true --hugepage=true 
Bench num: 1500000000, range: 1500000000
Keys:       16 bytes each
Values:     100 bytes each (50 bytes after compression)
Entries:    1500000000
RawSize:    165939.3 MB (estimated)
FileSize:   94413.8 MB (estimated)
WARNING: Snappy compression is not enabled
------------------------------------------------
Write buffer: 2048.00 KB. Compression: 0. 
Restore 716 pivots
Recover seq# 1500104000, log# 1367, min log#1357, file# 115307
using restored pivots
Log_Recover_Time, 0.0000, BucketCount, 716 , Log_size, 0.0 ,MB
loadreverse  : 90983363.000 micros/op 0 ops/sec;
Microseconds per op:
Count: 0 Average: 0.0000  StdDev: 0.00
Min: 0  Median: 0.0000  Max: 0
Percentiles: P50: 0.00 P75: 0.00 P99: 0.00 P99.9: 0.00 P99.99: 0.00
------------------------------------------------------

2019/09/20-02:04:05  ... thread 2: (1000000,1000000) ops and (5894.2,5894.2) ops/second in (169.657051,169.657051) seconds
2019/09/20-02:04:05  ... thread 1: (1000000,1000000) ops and (5888.8,5888.8) ops/second in (169.814566,169.814566) seconds
2019/09/20-02:04:05  ... thread 3: (1000000,1000000) ops and (5882.3,5882.3) ops/second in (170.001331,170.001331) seconds
2019/09/20-02:04:05  ... thread 0: (1000000,1000000) ops and (5878.0,5878.0) ops/second in (170.127195,170.127195) seconds
2019/09/20-02:06:12  ... thread 2: (1000000,2000000) ops and (7841.7,6729.9) ops/second in (127.522822,297.179873) seconds
2019/09/20-02:06:13  ... thread 3: (1000000,2000000) ops and (7848.9,6724.8) ops/second in (127.406529,297.407860) seconds
2019/09/20-02:06:13  ... thread 1: (1000000,2000000) ops and (7834.9,6723.8) ops/second in (127.634713,297.449279) seconds
2019/09/20-02:06:13  ... thread 0: (1000000,2000000) ops and (7849.6,6722.2) ops/second in (127.394271,297.521466) seconds
2019/09/20-02:08:15  ... thread 2: (1000000,3000000) ops and (8131.9,7140.3) ops/second in (122.971832,420.151705) seconds
2019/09/20-02:08:16  ... thread 0: (1000000,3000000) ops and (8127.6,7133.4) ops/second in (123.037928,420.559394) seconds
2019/09/20-02:08:16  ... thread 3: (1000000,3000000) ops and (8111.3,7131.1) ops/second in (123.284392,420.692252) seconds
2019/09/20-02:08:16  ... thread 1: (1000000,3000000) ops and (8104.8,7128.7) ops/second in (123.383216,420.832495) seconds
2019/09/20-02:10:18  ... thread 2: (1000000,4000000) ops and (8141.8,7366.8) ops/second in (122.823240,542.974945) seconds
2019/09/20-02:10:18  ... thread 0: (1000000,4000000) ops and (8140.1,7360.9) ops/second in (122.849223,543.408617) seconds
2019/09/20-02:10:19  ... thread 3: (1000000,4000000) ops and (8142.6,7359.7) ops/second in (122.811188,543.503440) seconds
2019/09/20-02:10:19  ... thread 1: (1000000,4000000) ops and (8138.0,7356.8) ops/second in (122.880639,543.713134) seconds
2019/09/20-02:12:21  ... thread 2: (1000000,5000000) ops and (8135.3,7508.7) ops/second in (122.921577,665.896522) seconds
2019/09/20-02:12:21  ... thread 0: (1000000,5000000) ops and (8138.3,7504.3) ops/second in (122.875965,666.284582) seconds
2019/09/20-02:12:22  ... thread 3: (1000000,5000000) ops and (8138.8,7503.3) ops/second in (122.868989,666.372429) seconds
2019/09/20-02:12:22  ... thread 1: (1000000,5000000) ops and (8138.6,7500.9) ops/second in (122.870995,666.584129) seconds
2019/09/20-02:14:24  ... thread 2: (1000000,6000000) ops and (8134.9,7606.3) ops/second in (122.926599,788.823121) seconds
2019/09/20-02:14:24  ... thread 0: (1000000,6000000) ops and (8137.7,7602.9) ops/second in (122.885458,789.170040) seconds
2019/09/20-02:14:25  ... thread 3: (1000000,6000000) ops and (8128.2,7600.7) ops/second in (123.028412,789.400841) seconds
2019/09/20-02:14:26  ... thread 1: (1000000,6000000) ops and (8029.6,7584.2) ops/second in (124.539362,791.123491) seconds
2019/09/20-02:16:27  ... thread 2: (1000000,7000000) ops and (8124.5,7676.2) ops/second in (123.085007,911.908128) seconds
2019/09/20-02:16:27  ... thread 0: (1000000,7000000) ops and (8125.5,7673.4) ops/second in (123.069955,912.239995) seconds
2019/09/20-02:16:28  ... thread 3: (1000000,7000000) ops and (8130.0,7672.1) ops/second in (123.001715,912.402556) seconds
2019/09/20-02:16:30  ... thread 1: (1000000,7000000) ops and (8049.7,7647.3) ops/second in (124.228982,915.352473) seconds
2019/09/20-02:18:30  ... thread 2: (1000000,8000000) ops and (8124.0,7729.5) ops/second in (123.092219,1035.000347) seconds
2019/09/20-02:18:31  ... thread 0: (1000000,8000000) ops and (8108.8,7725.3) ops/second in (123.322966,1035.562961) seconds
2019/09/20-02:18:33  ... thread 3: (1000000,8000000) ops and (7952.8,7706.1) ops/second in (125.741402,1038.143958) seconds
2019/09/20-02:18:34  ... thread 1: (1000000,8000000) ops and (8126.6,7704.1) ops/second in (123.053344,1038.405817) seconds
ycsbc        :      32.453 micros/op 30813 ops/sec;    3.4 MB/s (8000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 129.5973  StdDev: 120.16
Min: 1  Median: 132.0341  Max: 161047
Percentiles: P50: 132.03 P75: 162.40 P99: 512.55 P99.9: 812.75 P99.99: 15187.58
------------------------------------------------------
[       0,       1 ]        1   0.000%   0.000% 
(       1,       2 ]        8   0.000%   0.000% 
(       2,       3 ]      538   0.002%   0.002% 
(       3,       4 ]    23153   0.072%   0.074% 
(       4,       6 ]   894933   2.797%   2.871% #
(       6,      10 ]  2997507   9.367%  12.238% ##
(      10,      15 ]  3015909   9.425%  21.663% ##
(      15,      22 ]  1213755   3.793%  25.456% #
(      22,      34 ]   350554   1.095%  26.551% 
(      34,      51 ]    65920   0.206%  26.757% 
(      51,      76 ]    33413   0.104%  26.862% 
(      76,     110 ]  1598794   4.996%  31.858% #
(     110,     170 ] 15808755  49.402%  81.260% ##########
(     170,     250 ]  3280071  10.250%  91.510% ##
(     250,     380 ]  1903167   5.947%  97.458% #
(     380,     580 ]   744657   2.327%  99.785% 
(     580,     870 ]    45932   0.144%  99.928% 
(     870,    1300 ]     6859   0.021%  99.950% 
(    1300,    1900 ]     2855   0.009%  99.959% 
(    1900,    2900 ]     2843   0.009%  99.968% 
(    2900,    4400 ]     2551   0.008%  99.976% 
(    4400,    6600 ]     1539   0.005%  99.980% 
(    6600,    9900 ]     1543   0.005%  99.985% 
(    9900,   14000 ]     1103   0.003%  99.989% 
(   14000,   22000 ]     2964   0.009%  99.998% 
(   22000,   33000 ]      552   0.002% 100.000% 
(   33000,   50000 ]       78   0.000% 100.000% 
(   50000,   75000 ]        8   0.000% 100.000% 
(   75000,  110000 ]        4   0.000% 100.000% 
(  110000,  170000 ]       34   0.000% 100.000% 

2019/09/20-02:20:35  ... thread 1: (1000000,1000000) ops and (8426.8,8426.8) ops/second in (118.668320,118.668320) seconds
2019/09/20-02:20:35  ... thread 3: (1000000,1000000) ops and (8414.2,8414.2) ops/second in (118.846197,118.846197) seconds
2019/09/20-02:20:35  ... thread 0: (1000000,1000000) ops and (8406.9,8406.9) ops/second in (118.949369,118.949369) seconds
2019/09/20-02:20:36  ... thread 2: (1000000,1000000) ops and (8309.1,8309.1) ops/second in (120.349329,120.349329) seconds
2019/09/20-02:22:32  ... thread 1: (1000000,2000000) ops and (8523.4,8474.9) ops/second in (117.324001,235.992321) seconds
2019/09/20-02:22:32  ... thread 3: (1000000,2000000) ops and (8534.4,8473.9) ops/second in (117.172956,236.019153) seconds
2019/09/20-02:22:32  ... thread 0: (1000000,2000000) ops and (8529.5,8467.8) ops/second in (117.240032,236.189401) seconds
2019/09/20-02:22:33  ... thread 2: (1000000,2000000) ops and (8537.0,8421.5) ops/second in (117.137474,237.486803) seconds
2019/09/20-02:24:30  ... thread 1: (1000000,3000000) ops and (8446.7,8465.4) ops/second in (118.389389,354.381710) seconds
2019/09/20-02:24:30  ... thread 3: (1000000,3000000) ops and (8444.7,8464.1) ops/second in (118.417986,354.437139) seconds
2019/09/20-02:24:31  ... thread 0: (1000000,3000000) ops and (8438.1,8457.9) ops/second in (118.510605,354.700006) seconds
2019/09/20-02:24:40  ... thread 2: (1000000,3000000) ops and (7873.2,8230.5) ops/second in (127.012965,364.499768) seconds
2019/09/20-02:26:29  ... thread 1: (1000000,4000000) ops and (8452.8,8462.3) ops/second in (118.303996,472.685706) seconds
2019/09/20-02:26:29  ... thread 3: (1000000,4000000) ops and (8457.3,8462.4) ops/second in (118.240810,472.677949) seconds
2019/09/20-02:26:29  ... thread 0: (1000000,4000000) ops and (8456.4,8457.5) ops/second in (118.253031,472.953037) seconds
2019/09/20-02:26:44  ... thread 2: (1000000,4000000) ops and (8118.0,8202.1) ops/second in (123.182536,487.682304) seconds
2019/09/20-02:28:26  ... thread 3: (1000000,5000000) ops and (8540.8,8478.0) ops/second in (117.084484,589.762433) seconds
2019/09/20-02:28:26  ... thread 1: (1000000,5000000) ops and (8535.5,8476.8) ops/second in (117.157305,589.843011) seconds
2019/09/20-02:28:26  ... thread 0: (1000000,5000000) ops and (8532.7,8472.4) ops/second in (117.196283,590.149320) seconds
2019/09/20-02:28:40  ... thread 2: (1000000,5000000) ops and (8555.5,8270.4) ops/second in (116.883255,604.565559) seconds
2019/09/20-02:30:23  ... thread 3: (1000000,6000000) ops and (8544.6,8489.0) ops/second in (117.032696,706.795129) seconds
2019/09/20-02:30:23  ... thread 1: (1000000,6000000) ops and (8543.8,8487.9) ops/second in (117.044269,706.887280) seconds
2019/09/20-02:30:23  ... thread 0: (1000000,6000000) ops and (8537.0,8483.1) ops/second in (117.137425,707.286745) seconds
2019/09/20-02:30:38  ... thread 2: (1000000,6000000) ops and (8530.3,8312.6) ops/second in (117.228752,721.794311) seconds
2019/09/20-02:32:20  ... thread 1: (1000000,7000000) ops and (8561.1,8498.3) ops/second in (116.808006,823.695286) seconds
2019/09/20-02:32:20  ... thread 3: (1000000,7000000) ops and (8545.9,8497.1) ops/second in (117.015045,823.810174) seconds
2019/09/20-02:32:20  ... thread 0: (1000000,7000000) ops and (8552.0,8492.9) ops/second in (116.932392,824.219137) seconds
2019/09/20-02:32:35  ... thread 2: (1000000,7000000) ops and (8543.0,8344.8) ops/second in (117.054686,838.848997) seconds
2019/09/20-02:34:17  ... thread 1: (1000000,8000000) ops and (8523.1,8501.4) ops/second in (117.328241,941.023527) seconds
2019/09/20-02:34:17  ... thread 3: (1000000,8000000) ops and (8522.2,8500.2) ops/second in (117.339943,941.150117) seconds
2019/09/20-02:34:20  ... thread 0: (1000000,8000000) ops and (8368.2,8477.1) ops/second in (119.499705,943.718842) seconds
2019/09/20-02:34:32  ... thread 2: (1000000,8000000) ops and (8533.9,8368.0) ops/second in (117.179554,956.028551) seconds
ycsbb        :      29.878 micros/op 33469 ops/sec;    3.7 MB/s (7599999 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 118.1850  StdDev: 106.84
Min: 1  Median: 128.5422  Max: 29199
Percentiles: P50: 128.54 P75: 160.48 P99: 482.49 P99.9: 578.45 P99.99: 979.91
------------------------------------------------------
[       0,       1 ]     3028   0.009%   0.009% 
(       1,       2 ]    15897   0.050%   0.059% 
(       2,       3 ]    87374   0.273%   0.332% 
(       3,       4 ]   220041   0.688%   1.020% 
(       4,       6 ]  1437867   4.493%   5.513% #
(       6,      10 ]  3342438  10.445%  15.958% ##
(      10,      15 ]  2877905   8.993%  24.952% ##
(      15,      22 ]  1323298   4.135%  29.087% #
(      22,      34 ]   393634   1.230%  30.317% 
(      34,      51 ]    76112   0.238%  30.555% 
(      51,      76 ]    31671   0.099%  30.654% 
(      76,     110 ]  1546032   4.831%  35.485% #
(     110,     170 ] 15029621  46.968%  82.453% #########
(     170,     250 ]  3215209  10.048%  92.500% ##
(     250,     380 ]  1772291   5.538%  98.039% #
(     380,     580 ]   600244   1.876%  99.915% 
(     580,     870 ]    23841   0.075%  99.989% 
(     870,    1300 ]     1162   0.004%  99.993% 
(    1300,    1900 ]      700   0.002%  99.995% 
(    1900,    2900 ]      997   0.003%  99.998% 
(    2900,    4400 ]      353   0.001%  99.999% 
(    4400,    6600 ]       94   0.000%  99.999% 
(    6600,    9900 ]       21   0.000%  99.999% 
(    9900,   14000 ]       13   0.000% 100.000% 
(   14000,   22000 ]       94   0.000% 100.000% 
(   22000,   33000 ]       63   0.000% 100.000% 

2019/09/20-02:36:23  ... thread 3: (1000000,1000000) ops and (9302.3,9302.3) ops/second in (107.500177,107.500177) seconds
2019/09/20-02:36:24  ... thread 1: (1000000,1000000) ops and (9326.0,9326.0) ops/second in (107.227062,107.227062) seconds
2019/09/20-02:36:25  ... thread 0: (1000000,1000000) ops and (9109.2,9109.2) ops/second in (109.778679,109.778679) seconds
2019/09/20-02:36:26  ... thread 2: (1000000,1000000) ops and (9101.3,9101.3) ops/second in (109.874448,109.874448) seconds
2019/09/20-02:37:59  ... thread 3: (1000000,2000000) ops and (10423.2,9830.9) ops/second in (95.939939,203.440116) seconds
2019/09/20-02:38:00  ... thread 1: (1000000,2000000) ops and (10433.7,9848.8) ops/second in (95.843386,203.070448) seconds
2019/09/20-02:38:02  ... thread 2: (1000000,2000000) ops and (10430.4,9720.6) ops/second in (95.873277,205.747725) seconds
2019/09/20-02:38:07  ... thread 0: (1000000,2000000) ops and (9850.1,9465.2) ops/second in (101.522179,211.300858) seconds
2019/09/20-02:39:37  ... thread 3: (1000000,3000000) ops and (10170.4,9941.5) ops/second in (98.324806,301.764922) seconds
2019/09/20-02:39:38  ... thread 1: (1000000,3000000) ops and (10216.0,9968.2) ops/second in (97.885243,300.955691) seconds
2019/09/20-02:39:41  ... thread 2: (1000000,3000000) ops and (10163.8,9864.0) ops/second in (98.388840,304.136565) seconds
2019/09/20-02:39:51  ... thread 0: (1000000,3000000) ops and (9623.9,9517.5) ops/second in (103.908445,315.209303) seconds
2019/09/20-02:41:16  ... thread 3: (1000000,4000000) ops and (10098.3,9980.3) ops/second in (99.026093,400.791015) seconds
2019/09/20-02:41:18  ... thread 1: (1000000,4000000) ops and (9929.5,9958.5) ops/second in (100.709588,401.665279) seconds
2019/09/20-02:41:20  ... thread 2: (1000000,4000000) ops and (10102.2,9922.5) ops/second in (98.988479,403.125044) seconds
2019/09/20-02:41:36  ... thread 0: (1000000,4000000) ops and (9495.6,9512.0) ops/second in (105.312455,420.521758) seconds
2019/09/20-02:42:59  ... thread 1: (1000000,5000000) ops and (9950.9,9957.0) ops/second in (100.493292,502.158571) seconds
2019/09/20-02:43:00  ... thread 2: (1000000,5000000) ops and (9980.6,9934.1) ops/second in (100.193981,503.319025) seconds
2019/09/20-02:43:04  ... thread 3: (1000000,5000000) ops and (9325.9,9842.1) ops/second in (107.228769,508.019784) seconds
2019/09/20-02:43:16  ... thread 0: (1000000,5000000) ops and (10019.3,9609.3) ops/second in (99.807771,520.329529) seconds
2019/09/20-02:44:36  ... thread 1: (1000000,6000000) ops and (10317.3,10015.3) ops/second in (96.925031,599.083602) seconds
2019/09/20-02:44:37  ... thread 2: (1000000,6000000) ops and (10346.9,10000.6) ops/second in (96.647451,599.966476) seconds
2019/09/20-02:44:50  ... thread 3: (1000000,6000000) ops and (9429.7,9770.9) ops/second in (106.047801,614.067585) seconds
2019/09/20-02:44:53  ... thread 0: (1000000,6000000) ops and (10290.9,9716.6) ops/second in (97.172923,617.502452) seconds
2019/09/20-02:46:13  ... thread 1: (1000000,7000000) ops and (10333.3,10059.5) ops/second in (96.774619,695.858221) seconds
2019/09/20-02:46:15  ... thread 2: (1000000,7000000) ops and (10135.6,10019.6) ops/second in (98.662352,698.628828) seconds
2019/09/20-02:46:29  ... thread 3: (1000000,7000000) ops and (10054.9,9810.5) ops/second in (99.453563,713.521148) seconds
2019/09/20-02:46:30  ... thread 0: (1000000,7000000) ops and (10341.1,9801.1) ops/second in (96.701329,714.203781) seconds
2019/09/20-02:47:50  ... thread 1: (1000000,8000000) ops and (10307.0,10089.8) ops/second in (97.021710,792.879931) seconds
2019/09/20-02:47:54  ... thread 2: (1000000,8000000) ops and (10073.5,10026.3) ops/second in (99.270178,797.899006) seconds
2019/09/20-02:48:08  ... thread 0: (1000000,8000000) ops and (10136.4,9841.8) ops/second in (98.654840,812.858621) seconds
2019/09/20-02:48:11  ... thread 3: (1000000,8000000) ops and (9790.7,9808.0) ops/second in (102.138045,815.659193) seconds
ycsbd        :      25.491 micros/op 39229 ops/sec;    4.3 MB/s (7600000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 100.6030  StdDev: 36.75
Min: 0  Median: 115.0679  Max: 197342
Percentiles: P50: 115.07 P75: 154.33 P99: 456.70 P99.9: 589.49 P99.99: 2111.31
------------------------------------------------------
[       0,       1 ]    16698   0.052%   0.052% 
(       1,       2 ]    30928   0.097%   0.149% 
(       2,       3 ]    73345   0.229%   0.378% 
(       3,       4 ]   178600   0.558%   0.936% 
(       4,       6 ]  1342957   4.197%   5.133% #
(       6,      10 ]  5516987  17.241%  22.373% ###
(      10,      15 ]  3954902  12.359%  34.733% ##
(      15,      22 ]  1890079   5.906%  40.639% #
(      22,      34 ]   634658   1.983%  42.622% 
(      34,      51 ]   108408   0.339%  42.961% 
(      51,      76 ]    19593   0.061%  43.022% 
(      76,     110 ]  1200109   3.750%  46.773% #
(     110,     170 ] 12226842  38.209%  84.982% ########
(     170,     250 ]  2886314   9.020%  94.001% ##
(     250,     380 ]  1421001   4.441%  98.442% #
(     380,     580 ]   465678   1.455%  99.897% 
(     580,     870 ]    27526   0.086%  99.983% 
(     870,    1300 ]     1072   0.003%  99.987% 
(    1300,    1900 ]      819   0.003%  99.989% 
(    1900,    2900 ]     1344   0.004%  99.993% 
(    2900,    4400 ]      896   0.003%  99.996% 
(    4400,    6600 ]      809   0.003%  99.999% 
(    6600,    9900 ]       80   0.000%  99.999% 
(    9900,   14000 ]       91   0.000%  99.999% 
(   14000,   22000 ]      130   0.000% 100.000% 
(   22000,   33000 ]      130   0.000% 100.000% 
(  170000,  250000 ]        4   0.000% 100.000% 

2019/09/20-02:49:18  ... thread 2: (1000000,1000000) ops and (15540.3,15540.3) ops/second in (64.348619,64.348619) seconds
2019/09/20-02:49:19  ... thread 0: (1000000,1000000) ops and (15269.7,15269.7) ops/second in (65.489162,65.489162) seconds
2019/09/20-02:49:20  ... thread 1: (1000000,1000000) ops and (15145.9,15145.9) ops/second in (66.024560,66.024560) seconds
2019/09/20-02:49:20  ... thread 3: (1000000,1000000) ops and (15081.3,15081.3) ops/second in (66.307089,66.307089) seconds
2019/09/20-02:50:26  ... thread 2: (1000000,2000000) ops and (14730.3,15124.5) ops/second in (67.887068,132.235687) seconds
2019/09/20-02:50:27  ... thread 1: (1000000,2000000) ops and (14894.2,15019.0) ops/second in (67.140436,133.164996) seconds
2019/09/20-02:50:27  ... thread 3: (1000000,2000000) ops and (14874.3,14977.1) ops/second in (67.230124,133.537213) seconds
2019/09/20-02:50:29  ... thread 0: (1000000,2000000) ops and (14313.7,14776.2) ops/second in (69.863348,135.352510) seconds
2019/09/20-02:51:32  ... thread 1: (1000000,3000000) ops and (15358.9,15130.6) ops/second in (65.108772,198.273768) seconds
2019/09/20-02:51:32  ... thread 3: (1000000,3000000) ops and (15345.0,15097.7) ops/second in (65.167905,198.705118) seconds
2019/09/20-02:51:34  ... thread 0: (1000000,3000000) ops and (15307.7,14949.2) ops/second in (65.326594,200.679104) seconds
2019/09/20-02:51:38  ... thread 2: (1000000,3000000) ops and (13892.4,14690.2) ops/second in (71.982056,204.217743) seconds
2019/09/20-02:52:41  ... thread 1: (1000000,4000000) ops and (14495.7,14966.7) ops/second in (68.985818,267.259586) seconds
2019/09/20-02:52:42  ... thread 0: (1000000,4000000) ops and (14888.9,14934.1) ops/second in (67.164016,267.843120) seconds
2019/09/20-02:52:42  ... thread 3: (1000000,4000000) ops and (14315.7,14894.3) ops/second in (69.853307,268.558425) seconds
2019/09/20-02:52:46  ... thread 2: (1000000,4000000) ops and (14720.6,14697.8) ops/second in (67.932232,272.149975) seconds
2019/09/20-02:53:51  ... thread 1: (1000000,5000000) ops and (14262.2,14820.3) ops/second in (70.115189,337.374775) seconds
2019/09/20-02:53:51  ... thread 0: (1000000,5000000) ops and (14375.1,14818.9) ops/second in (69.564566,337.407686) seconds
2019/09/20-02:53:53  ... thread 3: (1000000,5000000) ops and (14051.0,14717.7) ops/second in (71.169093,339.727518) seconds
2019/09/20-02:53:55  ... thread 2: (1000000,5000000) ops and (14371.4,14631.3) ops/second in (69.582564,341.732539) seconds
2019/09/20-02:55:01  ... thread 1: (1000000,6000000) ops and (14372.9,14743.8) ops/second in (69.575589,406.950364) seconds
2019/09/20-02:55:01  ... thread 0: (1000000,6000000) ops and (14221.5,14715.8) ops/second in (70.316278,407.723964) seconds
2019/09/20-02:55:03  ... thread 3: (1000000,6000000) ops and (14270.3,14641.2) ops/second in (70.075841,409.803359) seconds
2019/09/20-02:55:05  ... thread 2: (1000000,6000000) ops and (14294.4,14574.1) ops/second in (69.957658,411.690197) seconds
2019/09/20-02:56:07  ... thread 1: (1000000,7000000) ops and (15014.7,14781.9) ops/second in (66.601278,473.551642) seconds
2019/09/20-02:56:08  ... thread 0: (1000000,7000000) ops and (14966.9,14751.2) ops/second in (66.814267,474.538231) seconds
2019/09/20-02:56:10  ... thread 3: (1000000,7000000) ops and (14995.6,14690.8) ops/second in (66.686424,476.489783) seconds
2019/09/20-02:56:17  ... thread 2: (1000000,7000000) ops and (13944.2,14480.6) ops/second in (71.714525,483.404722) seconds
2019/09/20-02:57:14  ... thread 1: (1000000,8000000) ops and (14875.0,14793.5) ops/second in (67.226986,540.778628) seconds
2019/09/20-02:57:15  ... thread 0: (1000000,8000000) ops and (14910.3,14770.9) ops/second in (67.067932,541.606163) seconds
2019/09/20-02:57:17  ... thread 3: (1000000,8000000) ops and (14872.0,14713.2) ops/second in (67.240672,543.730455) seconds
2019/09/20-02:57:29  ... thread 2: (1000000,8000000) ops and (13924.5,14408.7) ops/second in (71.815792,555.220514) seconds
ycsba        :      17.352 micros/op 57630 ops/sec;    6.4 MB/s (4000000 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 68.1667  StdDev: 128.70
Min: 0  Median: 9.9728  Max: 124502
Percentiles: P50: 9.97 P75: 133.89 P99: 420.46 P99.9: 579.27 P99.99: 2873.67
------------------------------------------------------
[       0,       1 ]    20349   0.064%   0.064% 
(       1,       2 ]   741510   2.317%   2.381% 
(       2,       3 ]  4654099  14.544%  16.925% ###
(       3,       4 ]  2906899   9.084%  26.009% ##
(       4,       6 ]  4137178  12.929%  38.938% ###
(       6,      10 ]  3564219  11.138%  50.076% ##
(      10,      15 ]  2378685   7.433%  57.509% #
(      15,      22 ]  1362173   4.257%  61.766% #
(      22,      34 ]   454856   1.421%  63.187% 
(      34,      51 ]    69190   0.216%  63.404% 
(      51,      76 ]    13975   0.044%  63.447% 
(      76,     110 ]   548158   1.713%  65.160% 
(     110,     170 ]  7909390  24.717%  89.877% #####
(     170,     250 ]  1832069   5.725%  95.602% #
(     250,     380 ]  1013886   3.168%  98.771% #
(     380,     580 ]   362684   1.133%  99.904% 
(     580,     870 ]    20765   0.065%  99.969% 
(     870,    1300 ]     2054   0.006%  99.975% 
(    1300,    1900 ]     1666   0.005%  99.981% 
(    1900,    2900 ]     3076   0.010%  99.990% 
(    2900,    4400 ]     1978   0.006%  99.996% 
(    4400,    6600 ]      640   0.002%  99.998% 
(    6600,    9900 ]      141   0.000%  99.999% 
(    9900,   14000 ]       99   0.000%  99.999% 
(   14000,   22000 ]      176   0.001% 100.000% 
(   22000,   33000 ]       74   0.000% 100.000% 
(   33000,   50000 ]        2   0.000% 100.000% 
(   50000,   75000 ]        3   0.000% 100.000% 
(   75000,  110000 ]        4   0.000% 100.000% 
(  110000,  170000 ]        2   0.000% 100.000% 

2019/09/20-02:59:47  ... thread 0: (1000000,1000000) ops and (7400.8,7400.8) ops/second in (135.119974,135.119974) seconds
2019/09/20-02:59:47  ... thread 1: (1000000,1000000) ops and (7367.4,7367.4) ops/second in (135.733497,135.733497) seconds
2019/09/20-02:59:49  ... thread 3: (1000000,1000000) ops and (7290.2,7290.2) ops/second in (137.170582,137.170582) seconds
2019/09/20-02:59:50  ... thread 2: (1000000,1000000) ops and (7216.3,7216.3) ops/second in (138.575796,138.575796) seconds
2019/09/20-03:02:02  ... thread 3: (1000000,2000000) ops and (7475.2,7381.6) ops/second in (133.774965,270.945547) seconds
2019/09/20-03:02:03  ... thread 1: (1000000,2000000) ops and (7349.0,7358.2) ops/second in (136.072873,271.806370) seconds
2019/09/20-03:02:04  ... thread 2: (1000000,2000000) ops and (7444.4,7328.6) ops/second in (134.329150,272.904946) seconds
2019/09/20-03:02:07  ... thread 0: (1000000,2000000) ops and (7106.0,7250.4) ops/second in (140.726931,275.846905) seconds
2019/09/20-03:04:16  ... thread 3: (1000000,3000000) ops and (7491.9,7418.0) ops/second in (133.476849,404.422396) seconds
2019/09/20-03:04:19  ... thread 2: (1000000,3000000) ops and (7425.9,7360.7) ops/second in (134.663588,407.568534) seconds
2019/09/20-03:04:24  ... thread 1: (1000000,3000000) ops and (7101.8,7270.7) ops/second in (140.810282,412.616652) seconds
2019/09/20-03:04:24  ... thread 0: (1000000,3000000) ops and (7295.9,7265.5) ops/second in (137.062457,412.909362) seconds
2019/09/20-03:06:32  ... thread 3: (1000000,4000000) ops and (7352.7,7401.6) ops/second in (136.003591,540.425987) seconds
2019/09/20-03:06:36  ... thread 2: (1000000,4000000) ops and (7320.6,7350.7) ops/second in (136.600274,544.168808) seconds
2019/09/20-03:06:42  ... thread 0: (1000000,4000000) ops and (7273.3,7267.5) ops/second in (137.489490,550.398852) seconds
2019/09/20-03:06:43  ... thread 1: (1000000,4000000) ops and (7195.6,7251.8) ops/second in (138.972911,551.589563) seconds
2019/09/20-03:08:46  ... thread 3: (1000000,5000000) ops and (7455.2,7412.2) ops/second in (134.133788,674.559775) seconds
2019/09/20-03:08:51  ... thread 2: (1000000,5000000) ops and (7386.5,7357.8) ops/second in (135.382295,679.551103) seconds
2019/09/20-03:08:57  ... thread 0: (1000000,5000000) ops and (7377.6,7289.2) ops/second in (135.545396,685.944248) seconds
2019/09/20-03:09:07  ... thread 1: (1000000,5000000) ops and (6954.9,7190.4) ops/second in (143.783458,695.373021) seconds
2019/09/20-03:11:01  ... thread 3: (1000000,6000000) ops and (7386.3,7407.9) ops/second in (135.385332,809.945107) seconds
2019/09/20-03:11:09  ... thread 2: (1000000,6000000) ops and (7263.2,7341.9) ops/second in (137.679527,817.230630) seconds
2019/09/20-03:11:18  ... thread 0: (1000000,6000000) ops and (7121.5,7260.7) ops/second in (140.420209,826.364457) seconds
2019/09/20-03:11:24  ... thread 1: (1000000,6000000) ops and (7300.4,7208.5) ops/second in (136.979370,832.352391) seconds
2019/09/20-03:13:18  ... thread 3: (1000000,7000000) ops and (7318.0,7394.9) ops/second in (136.650240,946.595347) seconds
2019/09/20-03:13:28  ... thread 2: (1000000,7000000) ops and (7195.7,7320.6) ops/second in (138.972657,956.203287) seconds
2019/09/20-03:13:36  ... thread 0: (1000000,7000000) ops and (7241.3,7257.9) ops/second in (138.097145,964.461602) seconds
2019/09/20-03:13:41  ... thread 1: (1000000,7000000) ops and (7301.4,7221.6) ops/second in (136.960195,969.312586) seconds
2019/09/20-03:15:41  ... thread 3: (1000000,8000000) ops and (6973.1,7339.4) ops/second in (143.408392,1090.003739) seconds
2019/09/20-03:15:44  ... thread 2: (1000000,8000000) ops and (7334.9,7322.4) ops/second in (136.334288,1092.537575) seconds
2019/09/20-03:15:53  ... thread 0: (1000000,8000000) ops and (7302.0,7263.4) ops/second in (136.949287,1101.410889) seconds
2019/09/20-03:15:57  ... thread 1: (1000000,8000000) ops and (7342.6,7236.5) ops/second in (136.191981,1105.504567) seconds
ycsbf        :      34.552 micros/op 28941 ops/sec;    3.2 MB/s (7999999 of 8000000 found)
Microseconds per op:
Count: 32000000 Average: 137.1705  StdDev: 132.71
Min: 0  Median: 136.4920  Max: 36808
Percentiles: P50: 136.49 P75: 167.33 P99: 519.74 P99.9: 775.01 P99.99: 3415.36
------------------------------------------------------
[       0,       1 ]    11670   0.036%   0.036% 
(       1,       2 ]    37356   0.117%   0.153% 
(       2,       3 ]    11634   0.036%   0.190% 
(       3,       4 ]    21345   0.067%   0.256% 
(       4,       6 ]    34923   0.109%   0.365% 
(       6,      10 ]   427842   1.337%   1.702% 
(      10,      15 ]  2232854   6.978%   8.680% #
(      15,      22 ]  3284990  10.266%  18.946% ##
(      22,      34 ]  1996612   6.239%  25.185% #
(      34,      51 ]   399314   1.248%  26.433% 
(      51,      76 ]    51329   0.160%  26.593% 
(      76,     110 ]   617646   1.930%  28.523% 
(     110,     170 ] 15565044  48.641%  77.164% ##########
(     170,     250 ]  4178124  13.057%  90.221% ###
(     250,     380 ]  2229257   6.966%  97.187% #
(     380,     580 ]   830222   2.594%  99.782% #
(     580,     870 ]    56270   0.176%  99.958% 
(     870,    1300 ]     3362   0.011%  99.968% 
(    1300,    1900 ]     2210   0.007%  99.975% 
(    1900,    2900 ]     3935   0.012%  99.987% 
(    2900,    4400 ]     2506   0.008%  99.995% 
(    4400,    6600 ]      904   0.003%  99.998% 
(    6600,    9900 ]      159   0.000%  99.998% 
(    9900,   14000 ]      130   0.000%  99.999% 
(   14000,   22000 ]      247   0.001% 100.000% 
(   22000,   33000 ]      114   0.000% 100.000% 
(   33000,   50000 ]        1   0.000% 100.000% 

2019/09/20-03:33:43  ... thread 0: (1000000,1000000) ops and (940.2,940.2) ops/second in (1063.559923,1063.559923) seconds
2019/09/20-03:34:05  ... thread 3: (1000000,1000000) ops and (921.1,921.1) ops/second in (1085.695145,1085.695145) seconds
2019/09/20-03:34:38  ... thread 1: (1000000,1000000) ops and (894.1,894.1) ops/second in (1118.380776,1118.380776) seconds
2019/09/20-03:34:43  ... thread 2: (1000000,1000000) ops and (889.7,889.7) ops/second in (1123.979218,1123.979218) seconds
2019/09/20-03:51:05  ... thread 0: (1000000,2000000) ops and (960.0,950.0) ops/second in (1041.637086,2105.197009) seconds
2019/09/20-03:51:32  ... thread 3: (1000000,2000000) ops and (955.0,937.7) ops/second in (1047.156313,2132.851458) seconds
2019/09/20-03:53:03  ... thread 2: (1000000,2000000) ops and (909.7,899.6) ops/second in (1099.252254,2223.231472) seconds
2019/09/20-03:53:07  ... thread 1: (1000000,2000000) ops and (901.6,897.8) ops/second in (1109.195042,2227.575818) seconds
ycsbe        :     278.455 micros/op 3591 ops/sec;   37.8 MB/s (2039 of 2000000 found)
Microseconds per op:
Count: 8000000 Average: 1086.1070  StdDev: 465.90
Min: 2  Median: 1083.7618  Max: 75754
Percentiles: P50: 1083.76 P75: 1534.72 P99: 2998.59 P99.9: 5794.13 P99.99: 21872.00
------------------------------------------------------
(       1,       2 ]        7   0.000%   0.000% 
(       2,       3 ]      205   0.003%   0.003% 
(       3,       4 ]     5493   0.069%   0.071% 
(       4,       6 ]    14401   0.180%   0.251% 
(       6,      10 ]    23274   0.291%   0.542% 
(      10,      15 ]    82014   1.025%   1.567% 
(      15,      22 ]   164169   2.052%   3.620% 
(      22,      34 ]   104602   1.308%   4.927% 
(      34,      51 ]     4672   0.058%   4.985% 
(      51,      76 ]      245   0.003%   4.989% 
(      76,     110 ]     1149   0.014%   5.003% 
(     110,     170 ]    30720   0.384%   5.387% 
(     170,     250 ]    94460   1.181%   6.568% 
(     250,     380 ]   417722   5.222%  11.789% #
(     380,     580 ]   855096  10.689%  22.478% ##
(     580,     870 ]  1251255  15.641%  38.119% ###
(     870,    1300 ]  1912044  23.901%  62.019% #####
(    1300,    1900 ]  2654574  33.182%  95.201% #######
(    1900,    2900 ]   299598   3.745%  98.946% #
(    2900,    4400 ]    65422   0.818%  99.764% 
(    4400,    6600 ]    17166   0.215%  99.979% 
(    6600,    9900 ]      364   0.005%  99.983% 
(    9900,   14000 ]      179   0.002%  99.985% 
(   14000,   22000 ]      375   0.005%  99.990% 
(   22000,   33000 ]      450   0.006%  99.996% 
(   33000,   50000 ]      295   0.004%  99.999% 
(   50000,   75000 ]       48   0.001% 100.000% 
(   75000,  110000 ]        1   0.000% 100.000% 


                               Compactions
Level Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0     18.21     0.00   3269.03
  1     45.09  6193.30   6050.97
  2    273.27 42233.45  40969.02
BucketCount: 800
WriteAmplification: 15.3835

seq# 1535474510, log# 1402, min log#1392, file# 118403